{
	"INJECTION": {
		"CLIENT_EVENT": "Go directly to jail. Do not pass go. Do not collect $200.",
		"SERVER_EVENT": "Go directly to jail. Do not pass go. Do not collect $200."
	},
	"MEDIOCRE": {
		"BAD_CHAT_MESSAGE": "Attempted to post a possibly bad message in the OOC chat: \"${DATA}\"",
		"BAD_PHONE_MESSAGE": "Attempted to create a possibly bad twitter post: \"${DATA}\"",
		"BAD_TWITTER_POST": "Attempted to create a possibly bad twitter post: \"${DATA}\"",
		"BAD_CHARACTER_CREATION_WORDS": "Attempted to create a character with a possibly bad word in either the name or backstory: \"${DATA}\"",
		"DISALLOWED_CHARACTER_NAME": "Attempted to create a character with a possibly bad name: \"${DATA}\"",
		"BAD_PED_MESSAGE": "Attempted to create a possibly bad ped message: \"${DATA}\"",
		"DISALLOWED_BIRTHDAY": "Attempted to create a character with a possibly bad birthday: \"${DATA}\""
	},
	"PEPEGA": {
		"MODERATE": "You have been globally banned from all OP-FW servers without any specified reasons.",
		"ULTIMATE": "You have been banned from this server."
	},
	"MODDING": {
		"ILLEGAL_NATIVE": "You cant use a spell that you haven't learned yet...",
		"ILLEGAL_GLOBAL": "You cant modify a spell that you haven't learned yet...",
		"SEMI_GODMODE": "Your insistence on the fountain of youth seems to have disrupted the natural flow of time. Eternity isn't as fun as it sounds.",
		"WEAPON_SPAWN": "Attempted to pull a rabbit out of the hat, found a bazooka instead.",
		"CLEAR_TASKS": "This is not a Jedi mind trick training center. Your efforts to influence the free will of others has been noted... and rejected.",
		"BLACKLISTED_COMMAND": "I'm sorry, but you do not have permissions to perform this command. Please contact the server administrators if you believe that this is an error.",
		"TEXT_ENTRY": "Inspecting Element is not permitted on this browser.",
		"PED_SPAWN": "You tried to perform mitosis, but there was not enough sun for photosynthesis.",
		"ILLEGAL_VEHICLE_MODIFIER": "Unlike Dom Toretto from Fast and Furious, we are not family.",
		"DISTANCE_TAZE": "Your stunning performance from a distance was not appreciated.",
		"HOTWIRE_DRIVING": "Vroom Vroom, I'm in me mums car.",
		"VEHICLE_MODIFICATION": "You couldn't find the headlight fluid for your car.",
		"INVINCIBILITY": "You are not the Black Knight, you may not be invincible.",
		"RUNTIME_TEXTURE": "Mod menu you have, use it you may not.",
		"PROJECTILE_EVENT": "This isn't Hogwarts and you're not Harry Potter. The indiscriminate casting of spells - or projectiles - isn't allowed here.",
		"PED_CHANGE": "Identity theft is not a joke, Jim! Millions of characters suffer every year.",
		"HONEYPOT": "You attempted to toggle your creative mode, but didn't have the permissions to do so.",
		"VEHICLE_SPAWN": "You tried to use redstone on a minecart but didn't have powered rails.",
		"FAST_MOVEMENT": "Flying is not enabled on this server.",
		"THERMAL_NIGHTVISION": "Brighter Nights is not allowed.",
		"INFINITE_AMMO": "Despite popular belief, the laws of conservation do apply here. The magic ammunition pouch has been confiscated.",
		"FREECAM": "You seem to have had an out of body experience.",
		"SUSPICIOUS_EXPLOSION": "Sorry, but this isn't a Michael Bay film. Excessive use of pyrotechnics is not permitted.",
		"BAD_SCREEN_WORD": "We've heard of open book exams, but this is ridiculous.",
		"ILLEGAL_DAMAGE": "The scales of power were tilted too far in your favor, disrupting the balance of our realm.",
		"INVALID_HEALTH": "Your health bar seems to have had a bit too much of spinach, Popeye",
		"BAD_ENTITY_SPAWN": "Spawned in an entity with model name `${DATA}`.",
		"PLAYER_BLIPS": "Airspace is full, UAV unavailable.",
		"UNDERGROUND": "You seem to have fallen into a rabbit hole.",
		"DAMAGE_MODIFIER": "Your power level cannot be over 9000.",
		"ILLEGAL_FREEZE": "While spirits may wander freely, we mere mortals are bound by the laws of physics. Sir Isaac Newton wouldn't have it any other way.",
		"SPECTATING": "You must be an FIB Agent to watch other players or use /gamemode spectator before spectating."
	},
	"ILLEGAL_VALUES": {
		"PED_OBJECT": "Attempting to add a ped object not in the 'allowed' list of ped objects.",
		"RAW_PED_OBJECT": "Attempting to add a raw ped object without proper permissions.",
		"SHOOTING_RANGE": "Attempting to pass invalid values for shootings spots.",
		"SECURITY_CAMERAS": "Attempting to tamper with illegal security cameras.",
		"BOOMBOX_ITEM_ID": "Attempting to use a boombox item with an illegal item id.",
		"INVALID_SHOOTING_SPOT": "Attempting to pass values for a shootings spot that doesn't exist.",
		"LIGHTER_ITEM_ID": "Attempting to use a lighter item with an illegal item id.",
		"EXTERNAL_SOUND_EFFECT": "Attempted to tell other clients to play an external audio without proper permissions.",
		"FIRE_EXTINGUISHER_MODEL": "Attempted to delete a fire extinguisher on all clients with a model that wasn't a fire extinguisher.",
		"PAWN_SHOP": "Attempting to pass values for a pawn shop that doesn't exist.",
		"RADIO_FREQUENCY": "Attempting to access illegal radio frequencies.",
		"PED_WEAPON_OBJECT": "Attempting to add a ped weapon object not in the weapon list.",
		"BURGER_SHOT_DELIVERY_ITEM_ID": "Attempting to use a burger shot delivery item with an illegal item id.",
		"WEATHER_NAME": "Attempting to use a weather spell with an illegal weather name.",
		"PROP_ITEM_ID": "Player attempted to use a prop item with an illegal item id."
	},
	"TIMEOUT_BYPASS": {
		"PED_ROBBING": "Excessive ped-robbing! (Bypassed server-timeout, most likely using an injector to accomplish this.)",
		"ZOMBIE_LOOTING": "Excessive zombie looting! (Bypassed server-timeout, most likely using an injector to accomplish this.)"
	},
	"FRAUD": {
		"CHARGEBACK": "Fraud / Chargeback"
	}
}