{
	"MEDIOCRE": {
		"BAD_TWITTER_POST": "Attempted to create a possibly bad twitter post: \"${DATA}\"",
		"BAD_CHARACTER_CREATION_WORDS": "Attempted to create a character with a possibly bad word in either the name or backstory: \"${DATA}\"",
		"DISALLOWED_BIRTHDAY": "Attempted to create a character with a possibly bad birthday: \"${DATA}\"",
		"BAD_PHONE_MESSAGE": "Attempted to create a possibly bad twitter post: \"${DATA}\"",
		"BAD_PED_MESSAGE": "Attempted to create a possibly bad ped message: \"${DATA}\"",
		"BAD_CHAT_MESSAGE": "Attempted to post a possibly bad message in the OOC chat: \"${DATA}\"",
		"DISALLOWED_CHARACTER_NAME": "Attempted to create a character with a possibly bad name: \"${DATA}\""
	},
	"PEPEGA": {
		"MODERATE": "You have been globally banned from all OP-FW servers without any specified reasons.",
		"ULTIMATE": "You have been banned from this server."
	},
	"TIMEOUT_BYPASS": {
		"PED_ROBBING": "Excessive ped-robbing! (Bypassed server-timeout, most likely using an injector to accomplish this.)",
		"ZOMBIE_LOOTING": "Excessive zombie looting! (Bypassed server-timeout, most likely using an injector to accomplish this.)"
	},
	"NO_PERMISSIONS": {
		"WIZARD_RUN_AS": "Attempted to run a command as another player without proper permissions.",
		"TOGGLE_MUTE": "Player attempted to toggle another players muted status but they didn't have the required permissions.",
		"CREATE_AIRDROP": "Player attempted to create an airdrop but they didn't have the required permissions to do so.",
		"NETWORK_OWNER_SUBSCRIPTION": "Attempted to subscribe to entity network owners without proper permission.",
		"DESTROY_FORCE_FIELD": "Player attempted to destroy a forcefield but they didn't have the required permissions to do so.",
		"ORBITCAM": "Attempted to toggle their orbitcam without required permissions.",
		"CREATE_FORCE_FIELD": "Player attempted to create a forcefield but they didn't have the required permissions to do so.",
		"SET_FAKE_PLATE": "Player attempted to set the fake plate of a vehicle without proper permissions.",
		"TELEPORT_PLAYER": "Player attempted to teleport a player, but they did not have the correct permissions to do so.",
		"ANNOUNCEMENT_MESSAGE": "Attempted to post a staff announcement.",
		"DESTROY_INSTANCE": "The player attempted to destroy an instance but they were not a developer.",
		"ADD_PLAYER_TO_INSTANCE": "The player attempted to add a player to an instance but they were not a developer.",
		"KICK_PLAYER": "Attempted to kick a player without proper permissions.",
		"LOCATE_ENTITY": "The player attempted to locate an entity without proper permission.",
		"WIPE_FIRST_OWNED": "Player attempted to wipe first owned entities without proper permissions.",
		"CHAT_CLEAR": "Player attempted to clear the chat for all players, but didn't have proper permissions to do so.",
		"SET_MODEL_DETECTED": "Player attempted to add a model to the detection list, but didn't have correct permissions to do so.",
		"PUSH_PLAYER": "Player attempted to push a player but they didn't have the required permissions.",
		"REFRESH_MAGAZINES": "Player attempted to refresh the magazines without proper permissions.",
		"SET_BODY_ARMOR_LEVEL_PLAYER": "Player attempted to set another player's body armor level but they didn't have the required permissions to do so.",
		"STAFF_MESSAGE": "Player attempted sending a message in the staff chat, but wasn't staff.",
		"RIOT_MODE": "Attempted to toggle riot mode without proper permission.",
		"NOTEPAD_INFO": "Missing locale (notepad_info_missing_permissions)",
		"SPAWN_CONTRACT": "Player attempted to spawn a boosting contract without proper permissions.",
		"FEATURE_TOGGLE": "Attempted to toggle their own or someone else's '${DATA}', but didn't have proper permissions to do so.",
		"CREATE_SHOCKWAVE": "Player attempted to create a shockwave but they didn't have the required permissions.",
		"CREATE_AIRSUPPORT": "Missing locale (create_airsupport_missing_permissions)",
		"FORTNITE_ADD_BUILDING": "Player attempted to add a Fortnite building but they didn't have the required permissions to do so.",
		"REPLACE_VEHICLE": "Player attempted to replace their vehicle but they didn't have the required permissions to do so.",
		"PROTECTIVE_MODE": "Attempted to toggle the server protective mode without proper permissions.",
		"HIDE_STAFF": "Attempted to hide their staff status without proper permissions.",
		"TOGGLE_PLAYER_TRACK": "Attempted to toggle player tracking without proper permissions.",
		"WIZARD_ACTION": "Attempted to make a player do a wizard action without proper permissions.",
		"CREATE_EXPLOSION": "Player attempted to create an explosion but they were not a developer.",
		"SET_HANDLING_OVERRIDE": "The player attempted to set a handling override without proper permissions.",
		"CREATE_AIRDROP_CUSTOM": "Player attempted to create a custom airdrop but they didn't have the required permissions to do so.",
		"CLOTHING_MENU": "Player attempted to open the clothing menu for another player but didn't have the required permissions.",
		"SET_PLAYER_SCALE": "The player did not have the required permission to set a player's scale.",
		"FREEZE_WEATHER": "Attempted to freeze the weather without required permissions.",
		"SET_WEATHER": "Attempted to set the weather without required permissions.",
		"WEAPON_ATTACHMENT": "Attempted to toggle a weapon attachment without proper permission.",
		"JOIN_BATTLE_ROYALE_INSTANCE": "Player attempted to join a Battle Royale instance but didn't have the required permissions to do so.",
		"START_ESCAPE_ROOM": "Player attempted to start an escape room but they didn't have the required permissions to do so.",
		"CREATE_VEHICLE": "Player attempted to create a vehicle but they didn't have the required permissions to do so.",
		"PANEL_GET_INFO": "Player attempted to get info about a player without proper permissions.",
		"UNSCOOP": "Player attempted to unscoop without proper permissions.",
		"CREATE_TITANIC": "Player attempted to create a Titanic but they didn't have the required permissions.",
		"SET_CASINO_SCREEN_ID": "Player attempted to set the casino screen id, but didn't have correct permissions to do so.",
		"RESET_STATUS": "Attempted to reset a player's status without required permissions.",
		"SET_LIVERY": "Player attempted to set the livery of a vehicle without proper permissions.",
		"BLACKLIST_VIDEO": "Player attempted to blacklist a video but they didn't have the required permissions.",
		"SET_DURABILITY": "Attempted to set an items durability without required permissions.",
		"TOGGLE_COLLISIONS": "Player attempted to toggle their collisions without proper permissions.",
		"REMOVE_NOTICE": "Player attempted to remove a notice without proper permissions.",
		"REVIVE_SELF": "Player attempted to revive another themselves but they didn't have the required permissions to do so.",
		"GET_LOGS": "Player attempted to get logs without proper permissions.",
		"UNLOAD_CHARACTER": "The player attempted to unload a player's character but they were not staff.",
		"SET_TIME_SCALE": "Player attempted to set the time scale but they didn't have the required permissions.",
		"VEHICLE_TEMP_ACTION": "Player attempted to run a vehicle temp action without proper permissions.",
		"SET_JOB": "Attempted to set a job without proper permissions.",
		"TOGGLE_DUTY_STATUS": "Player attempted to toggle on duty status via command without proper permissions.",
		"DRIVE_FOR_PLAYER": "Player attempted to drive for player but they didn't have the required permissions to do so.",
		"ISOLATE_PLAYER": "Player attempted to isolate another player without proper permissions.",
		"SET_HOUR": "Attempted to set the hour without required permissions.",
		"ROLL_LOTTERY": "The player attempted to roll the lottery but had no permission to do so.",
		"UNCARRY": "Attempted to force stop carry without proper permission.",
		"SPAWN_VEHICLE": "Player attempted to spawn a vehicle but didn't have the required permissions to do so.",
		"TOGGLE_PLAYER_STATS": "Player attempted to toggle player stats without proper permissions.",
		"WIPE_BOOMBOXES": "Player attempted to wipe boomboxes, but didn't have correct permissions to do so.",
		"SPAWN_MAP_PIECE": "Player attempted to spawn a map piece without proper permissions.",
		"REMOVE_PLAYER_FROM_INSTANCE": "The player attempted to remove a player from an instance but they were not a developer.",
		"SET_METADATA": "Attempted to set an items metadata without required permissions.",
		"SET_WARNING_MESSAGE": "Attempted to set the server's warning message without proper permissions.",
		"TOGGLE_REFLECTION": "Attempted to toggle damage reflection without proper permissions.",
		"MONEY_EVENT": "Attempted to toggle money event `${DATA}`.",
		"REMOVE_PEDS": "Attempted to remove spawned peds without proper permissions.",
		"ADD_DETECTION_AREA": "Player attempted to add a detection area, but didn't have correct permissions to do so.",
		"GET_PLAYERS_FROM_INSTANCE": "The player attempted to get the players from an instance but they were not a developer.",
		"SET_MODEL_UNDETECTED": "Player attempted to remove a model from the detection list, but didn't have correct permissions to do so.",
		"GET_PLAYER_LAST_DEATH": "Player attempted to get a player's last death, but didn't have correct permissions to do so.",
		"TAKE_FEE": "Player attempted to take jackpot fees without proper permissions.",
		"BLACKOUT": "Attempted to toggle a blackout without required permissions.",
		"WIPE_PROPS": "Player attempted to wipe props but they didn't have the required permissions to do so.",
		"SUPER_JUMP": "Attempted to toggle their super jump without proper permissions.",
		"START_BATTLE_ROYALE": "Player attempted to start a Battle Royale but they didn't have the required permissions to do so.",
		"FAKE_PLATE": "Player attempted to set a fake plate via command without proper permissions.",
		"PED_ASSIGN_TASK": "Attempted to assign a task to spawned peds without proper permissions.",
		"SHOW_ALERT": "Player attempted to show an alert to another player but they didn't have the required permissions to do so.",
		"SET_DIRT_LEVEL": "Player attempted to set the dirt level of a vehicle without proper permissions.",
		"FREEZE_TIME": "Attempted to freeze the time without required permissions.",
		"RANGE_REVIVE": "Player attempted to revive players in a certain range, but didn't have correct permissions to do so.",
		"TOGGLE_LISTENING": "Player attempted to toggle their listening status but they didn't have the required permissions.",
		"ADD_VEHICLE": "The player attempted to add a vehicle to someone's garage without proper permissions.",
		"SET_MINUTE": "Attempted to set the minute without required permissions.",
		"TELEPORT_TO_COORDINATES": "The player attempted to teleport to some coordinates but they were not staff.",
		"CHECK_PLAYTIME": "Player attempted to check someone else's playtime, but didn't have correct permissions to do so.",
		"POPULATION_DENSITY": "Player attempted to set the population density without proper permissions.",
		"FREEZE": "Player attempted to freeze or unfreeze another player without proper permissions.",
		"TOGGLE_DISABLED_BRAKES": "Player attempted to toggle disabled brakes via command without proper permissions.",
		"GET_PINGS": "Player attempted to get pings but they didn't have the required permissions to do so.",
		"REMOVE_DETECTION_AREA": "Player attempted to remove a detection area, but didn't have correct permissions to do so.",
		"SET_MODIFICATIONS": "Player attempted to set a modification of a vehicle without proper permissions.",
		"REMOVE_RIOT_PLAYER": "Attempted to add a player to the riot list without proper permission.",
		"SET_BODY_ARMOR_LEVEL_SELF": "Player attempted to set their own body armor level but they didn't have the required permissions to do so.",
		"LEAVE_BATTLE_ROYALE_INSTANCE": "Player attempted to leave a Battle Royale instance but didn't have the required permissions to do so.",
		"WIPE_INVENTORIES": "Player attempted to wipe inventories, but didn't have correct permissions to do so.",
		"ADD_RIOT_PLAYER": "Attempted to add a player to the riot list without proper permission.",
		"SPAWN_PED": "Attempted to spawn a ped without proper permissions.",
		"GET_RECENT_DEATHS": "Player attempted to get recent deaths, but didn't have correct permissions to do so.",
		"MOVE_ENTITY": "The player attempted to move an entity without proper permission.",
		"REFRESH_EMOJIS": "Player attempted to refresh emojis without proper permissions.",
		"ADVANCE_WEATHER": "Attempted to advance the weather without required permissions.",
		"REFILL_NOS": "Player attempted to refill their NOS without proper permissions.",
		"BAN_PLAYER": "Attempted to ban a player without proper permissions.",
		"SPAWN_ITEM": "Attempted to spawn an item without proper permissions",
		"ENTITY_WIPE": "Player attempted to wipe entities, but didn't have permissions.",
		"FORTNITE_WIPE_BUILDINGS": "Player attempted to add wipe Fortnite buildings but they didn't have the required permissions to do so.",
		"TOGGLE_STAFF": "Attempted to toggle staff availability without proper permissions.",
		"SET_IDENTITY": "Player attempted to set their player name without proper permissions.",
		"ADD_NOTICE": "Player attempted to add a notice without proper permissions.",
		"FAKE_DISCONNECT": "Player attempted to fake disconnect without proper permissions.",
		"REPAIR_VEHICLE": "Player attempted to repair a vehicle without proper permissions.",
		"SLAP": "Player attempted to slap another player without proper permissions.",
		"PLAYER_INFO": "Attempted to get a player's character information without proper permission.",
		"DELETE_ENTITY": "The player attempted to delete an entity without proper permission.",
		"VDM": "Player attempted to run the vdm command without proper permission.",
		"CLEAN_PED": "Attempted to clean a player's ped without required permissions.",
		"WIZARD_ACTION_RADIUS": "Attempted to make players in a certain radius do wizard actions without proper permissions.",
		"DAMAGE_PLAYER": "Player attempted to damage another player without proper permissions.",
		"WIPE_NOTEPADS": "Missing locale (wipe_notepads_missing_permissions)",
		"MUTE_PLAYER": "Player attempted to mute a player, but didn't have correct permissions to do so.",
		"RESKIN": "Player attempted to toggle the radio debug without proper permission.",
		"SET_OCEAN_SCALER": "The player did not have the required permission to set the ocean scaler.",
		"TOGGLE_BATTLE_ROYALE": "Player attempted to toggle the Battle Royale but they didn't have the required permissions to do so.",
		"IGNITION_BOMB": "Player attempted to toggle an ignition bomb but they didn't have the required permissions.",
		"TOGGLE_VEHICLE_WEAPONS": "The player attempted to toggle vehicle weapons on a vehicle without proper permissions.",
		"INJECT_CODE": "The player attempted to inject code but they were not a developer.",
		"TOGGLE_TSUNAMI": "Missing locale (toggle_tsunami_no_permissions)",
		"RESET_DAILY_ACTIVITIES": "Player attempted to reset their daily activities without proper permissions.",
		"FORCE_OPEN_INVENTORY": "Attempted to force-open an inventory without proper permission.",
		"TOGGLE_FLAG_SWAP": "Attempted to toggle flag swaps without proper permissions.",
		"REVIVE_PLAYER": "Player attempted to revive another player but they didn't have the required permissions to do so.",
		"WEAPON_TINT": "Attempted to set a weapon tint without proper permission.",
		"START_CARGO": "Player attempted to start the Cargo heist but they didn't have permissions to do so.",
		"TRIGGER_HEADACHE": "Attempted to trigger a headache without proper permissions.",
		"REGISTER_WEAPON": "Player attempted to register a weapon without proper permissions.",
		"END_CARGO": "Player attempted to end the Cargo heist but they didn't have permissions to do so.",
		"UNMUTE_PLAYER": "Player attempted to unmute a player, but didn't have correct permissions to do so.",
		"RADIO_DEBUG": "Attempted to toggle the radio debug without proper permission.",
		"SET_VEHICLE_FUEL": "Player attempted to set a vehicles fuel level without proper permissions.",
		"REMOVE_HANDLING_OVERRIDE": "The player attempted to remove a handling override without proper permissions.",
		"PLAY_AUDIO": "Player attempted to play an audio but they didn't have the required permissions to do so.",
		"SPAWN_TRAIN": "Player attempted to spawn a train but they didn't have the required permissions to do so.",
		"GET_ENTITY_STATES": "Player attempted to get a specific entities states without proper permissions.",
		"CREATE_AIRSTRIKE": "Player attempted to create an airstrike but they didn't have the required permissions to do so.",
		"TELEPORT_TO_WAYPOINT": "The player attempted to teleport to a waypoint but they were not staff.",
		"SPAWN_PROP": "Player attempted to spawn a prop but they didn't have the required permissions to do so.",
		"CREATE_INSTANCE": "The player attempted to create an instance but they were not a developer."
	},
	"ILLEGAL_VALUES": {
		"RADIO_FREQUENCY": "Attempting to access illegal radio frequencies.",
		"SECURITY_CAMERAS": "Attempting to tamper with illegal security cameras.",
		"PED_WEAPON_OBJECT": "Attempting to add a ped weapon object not in the weapon list.",
		"EXTERNAL_SOUND_EFFECT": "Attempted to tell other clients to play an external audio.",
		"WEATHER_NAME": "Attempting to use a weather spell with an illegal weather name.",
		"INVALID_SHOOTING_SPOT": "Attempting to pass values for a shootings spot that doesn't exist.",
		"BURGER_SHOT_DELIVERY_ITEM_ID": "Attempting to use a burger shot delivery item with an illegal item id.",
		"SHOOTING_RANGE": "Attempting to pass invalid values for shootings spots.",
		"PAWN_SHOP": "Attempting to pass values for a pawn shop that doesn't exist.",
		"FIRE_EXTINGUISHER_MODEL": "Attempted to delete a fire extinguisher on all clients with a model that wasn't a fire extinguisher.",
		"RAW_PED_OBJECT": "Attempting to add a raw ped object without proper permissions.",
		"LIGHTER_ITEM_ID": "Attempting to use a lighter item with an illegal item id.",
		"PED_OBJECT": "Attempting to add a ped object not in the 'allowed' list of ped objects.",
		"BOOMBOX_ITEM_ID": "Attempting to use a boombox item with an illegal item id.",
		"PROP_ITEM_ID": "Player attempted to use a prop item with an illegal item id."
	},
	"THREATS": {
		"DDOS": "Threatening to attack our infrastructure."
	},
	"FRAUD": {
		"CHARGEBACK": "Fraud / Chargeback"
	},
	"MODDING": {
		"PED_SPAWN": "You tried to perform mitosis, but there was not enough sun for photosynthesis.",
		"RUNTIME_TEXTURE": "Mod menu you have, use it you may not.",
		"BAD_ENTITY_SPAWN": "Spawned in an entity with model name `${DATA}`.",
		"HONEYPOT": "You attempted to toggle your creative mode, but didn't have the permissions to do so.",
		"PROJECTILE_EVENT": "This isn't Hogwarts and you're not Harry Potter. The indiscriminate casting of spells - or projectiles - isn't allowed here.",
		"BAD_SCREEN_WORD": "We've heard of open book exams, but this is ridiculous.",
		"VEHICLE_MODIFICATION": "You couldn't find the headlight fluid for your car.",
		"SUSPICIOUS_EXPLOSION": "Sorry, but this isn't a Michael Bay film. Excessive use of pyrotechnics is not permitted.",
		"VEHICLE_SPAWN": "You tried to use redstone on a minecart but didn't have powered rails.",
		"SPIKED_RESOURCE": "Trying to change the script without permission is like trying to change the ending of a story just because you don't like it.",
		"BLACKLISTED_COMMAND": "I'm sorry, but you do not have permissions to perform this command. Please contact the server administrators if you believe that this is an error.",
		"DAMAGE_MODIFIER": "Your power level cannot be over 9000.",
		"SEMI_GODMODE": "Your insistence on the fountain of youth seems to have disrupted the natural flow of time. Eternity isn't as fun as it sounds.",
		"TEXT_ENTRY": "Inspecting Element is not permitted on this browser.",
		"ILLEGAL_NATIVE": "You cant use a spell that you haven't learned yet...",
		"PLAYER_BLIPS": "Airspace is full, UAV unavailable.",
		"DISTANCE_TAZE": "Your stunning performance from a distance was not appreciated.",
		"HOTWIRE_DRIVING": "Vroom Vroom, I'm in me mums car.",
		"INVINCIBILITY": "You are not the Black Knight, you may not be invincible.",
		"HIGH_DAMAGE": "The scales of power were tilted too far in your favor, disrupting the balance of our realm.",
		"CLEAR_TASKS": "This is not a Jedi mind trick training center. Your efforts to influence the free will of others has been noted... and rejected.",
		"ILLEGAL_FREEZE": "While spirits may wander freely, we mere mortals are bound by the laws of physics. Sir Isaac Newton wouldn't have it any other way.",
		"INVALID_HEALTH": "Your health bar seems to have had a bit too much of spinach, Popeye",
		"SPECTATING": "You must be an FIB Agent to watch other players or use /gamemode spectator before spectating.",
		"PED_CHANGE": "Identity theft is not a joke, Jim! Millions of characters suffer every year.",
		"WEAPON_SPAWN": "Attempted to pull a rabbit out of the hat, found a bazooka instead.",
		"ILLEGAL_VEHICLE_MODIFIER": "Unlike Dom Toretto from Fast and Furious, we are not family.",
		"FAST_MOVEMENT": "Flying is not enabled on this server.",
		"THERMAL_NIGHTVISION": "Brighter Nights is not allowed.",
		"FREECAM": "You seem to have had an out of body experience."
	},
	"INJECTION": {
		"CLIENT_EVENT": "Go directly to jail. Do not pass go. Do not collect $200.",
		"SERVER_EVENT": "Go directly to jail. Do not pass go. Do not collect $200."
	}
}